BAS BMEKZU Project/src/Documents/ОперацияБух/ОперацияБух.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОперацияБух</name>
  <basedOn>Catalog.ТиповыеОперации</basedOn>
  <posting>Deny</posting>
  <registerRecords>AccumulationRegister.ИНАГРО_РасчетыПоУслугам</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_Форма49</registerRecords>
  <registerRecords>InformationRegister.ПараметрыАмортизацииОСБухгалтерскийУчет</registerRecords>
  <registerRecords>InformationRegister.МестонахождениеОСБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_ЗатратыНаВыпуск</registerRecords>
  <registerRecords>AccumulationRegister.ПродажиНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.РозничныеПродажиПодакцизныхТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_ЗатратыНаПроизводство</registerRecords>
  <registerRecords>InformationRegister.ПервоначальныеСведенияНМАНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>InformationRegister.СчетаБухгалтерскогоУчетаНМА</registerRecords>
  <registerRecords>AccumulationRegister.ОжидаемыйИПодтвержденныйНДСПродаж</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_ВыпускПродукции</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_ВыполненныеТехнологическиеОперации</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_ЦеныНаУслуги</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_СостояниеРаботниковОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.КнигаДоходовРасходовПоЕдиномуНалогу</registerRecords>
  <registerRecords>InformationRegister.ЦеныНоменклатуры</registerRecords>
  <registerRecords>AccumulationRegister.НачисленияУдержанияПоСотрудникам</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_КонтрольОтраженияВвозаВывозаСобственногоЗернаВРегламентированномУчете</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоНДФЛ</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_ТопливоВТС</registerRecords>
  <registerRecords>CalculationRegister.ИНАГРО_Отражение</registerRecords>
  <registerRecords>InformationRegister.НалоговыеНазначенияОС</registerRecords>
  <registerRecords>InformationRegister.СобытияОСОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_Остатки_Сводная</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_КонтрольВвозаСобственногоЗерна</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_РезультатыНаблюденияСостоянияЗерна</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_ОперативныеОстатки</registerRecords>
  <registerRecords>InformationRegister.ЛьготыПоНДФЛСотрудников</registerRecords>
  <registerRecords>InformationRegister.ПараметрыАмортизацииОСНалоговыйУчет</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_ИспользуемыеНомераПроб</registerRecords>
  <registerRecords>AccumulationRegister.КорректировкиНалоговыхНазначенийТЗР</registerRecords>
  <registerRecords>InformationRegister.ПорядокЗакрытияПодразделенийОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_ВыпускПродукцииОрганизации</registerRecords>
  <registerRecords>CalculationRegister.Начисления</registerRecords>
  <registerRecords>CalculationRegister.ИНАГРО_ВзносыВФонды</registerRecords>
  <registerRecords>InformationRegister.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_ДанныеПоКачествуПартийЗерна</registerRecords>
  <registerRecords>InformationRegister.МестонахождениеНМАБухгалтерскийУчет</registerRecords>
  <registerRecords>InformationRegister.ПервоначальныеСведенияОСБухгалтерскийУчет</registerRecords>
  <registerRecords>CalculationRegister.Удержания</registerRecords>
  <registerRecords>InformationRegister.УдалитьПараметрыРасчетаИндексации</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_ВзносыВФондыРаботниковОрганизаций</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_ЖурналЛабораторныхАнализов</registerRecords>
  <registerRecords>InformationRegister.НачислениеАмортизацииОСНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_Форма36Сводная</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_РасчетныйВыпускПродукции</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_КонтрольВывозаСобственногоЗерна</registerRecords>
  <registerRecords>InformationRegister.ГрафикиАмортизацииОСБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_Форма36</registerRecords>
  <registerRecords>InformationRegister.УдалитьВзносыВФондыРаботниковОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ВыпускПродукцииУслугБухгалтерскийУчет</registerRecords>
  <registerRecords>InformationRegister.ГарантийныеСрокиНалоговыйУчет</registerRecords>
  <registerRecords>InformationRegister.КадроваяИсторияСотрудников</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_ЗначенияБазисов</registerRecords>
  <registerRecords>InformationRegister.РасчетСписанияРБП</registerRecords>
  <registerRecords>InformationRegister.СостоянияОСОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_ВзаиморасчетыПоНачислениямЗаСчетФСС</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоУдержаниям</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_ПлановыеЗатратыНаВыпуск</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_ПлановыеУдержанияРаботниковОрганизаций</registerRecords>
  <registerRecords>InformationRegister.НачислениеАмортизацииОСБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_РабочееВремяРаботниковОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.УдалитьОжидаемыйИПодтвержденныйНДСПродаж</registerRecords>
  <registerRecords>InformationRegister.РасчетРаспределенияКосвенныхРасходов</registerRecords>
  <registerRecords>InformationRegister.СостоянияНМАОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.НДСНалоговыйКредит</registerRecords>
  <registerRecords>AccumulationRegister.ПродажиВРазрезеГарантийныхСроковНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.УдалитьОжидаемыйИПодтвержденныйНДСПриобретений</registerRecords>
  <registerRecords>AccumulationRegister.ОжидаемыйИПодтвержденныйНДСПриобретений</registerRecords>
  <registerRecords>CalculationRegister.ИНАГРО_РасчетСреднегоЗаработка</registerRecords>
  <registerRecords>AccumulationRegister.ПереоценкаОСБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_Остатки</registerRecords>
  <registerRecords>InformationRegister.РасчетПереоценкиВалютныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.РеализованныеТоварыКомитентов</registerRecords>
  <registerRecords>InformationRegister.ЕСВСотрудников</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_ПоказанияСпидометраИБака</registerRecords>
  <registerRecords>InformationRegister.СчетаБухгалтерскогоУчетаОС</registerRecords>
  <registerRecords>InformationRegister.ПлановыеУдержания</registerRecords>
  <registerRecords>InformationRegister.УдалитьПлановыеУдержанияРаботниковОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_ТоварыНаСкладах</registerRecords>
  <registerRecords>InformationRegister.ИндексированныйДоходСовместителей</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_ШтатноеРасписаниеОрганизаций</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_ПараметрыФиксированнойИндексации</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_РаботникиОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.УдалитьПродажиНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.ВыработкаНМА</registerRecords>
  <registerRecords>AccumulationRegister.НДСНалоговыеОбязательства</registerRecords>
  <registerRecords>AccumulationRegister.ПриобретенияНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_МатериалыСписанныеНаТранспорт</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_НадбавкиПоШтатномуРасписаниюОрганизаций</registerRecords>
  <registerRecords>InformationRegister.ПервоначальныеСведенияНМАБухгалтерскийУчет</registerRecords>
  <registerRecords>InformationRegister.КоэффициентыПропорциональногоОтнесенияНДСНаКредит</registerRecords>
  <registerRecords>AccumulationRegister.НДФЛПоСотрудникам</registerRecords>
  <registerRecords>AccumulationRegister.РеализацияУслуг</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_КонтрольВеса</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСДепонентами</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_ПланПосева</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_ДвиженияПоПереработке</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоВзносамВФонды</registerRecords>
  <registerRecords>AccumulationRegister.ЕСВПоСотрудникам</registerRecords>
  <registerRecords>InformationRegister.РасчетСебестоимостиПродукцици</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_ЗатратыОрганизаций</registerRecords>
  <registerRecords>CalculationRegister.ИНАГРО_Удержания</registerRecords>
  <registerRecords>InformationRegister.УдалитьПлановыеНачисленияРаботниковОрганизаций</registerRecords>
  <registerRecords>InformationRegister.КоэффициентыДляЗаполнениПриложенияСВДекларацииПоПрибыли</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьПриобретенияОСПропорциональноОблагаемыхНДС</registerRecords>
  <registerRecords>CalculationRegister.ИНАГРО_Начисления</registerRecords>
  <registerRecords>InformationRegister.ПервоначальныеСведенияОСНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_ЗакупкиОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_ВедомостьДвижений</registerRecords>
  <registerRecords>InformationRegister.ПлановыеНачисления</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_ПараметрыВыплатыЗПРаботников</registerRecords>
  <registerRecords>InformationRegister.ОплатаВедомостейНаВыплатуЗарплаты</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_КоэффициентПовышенияОкладов</registerRecords>
  <registerRecords>CalculationRegister.УДАЛИТЬВзносыВФондыИНалоги</registerRecords>
  <registerRecords>InformationRegister.ПараметрыРасчетаИндексации</registerRecords>
  <registerRecords>AccumulationRegister.УдалитьПриобретенияНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_КонтрольПриказовНаВывоз</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_РазницаКоличества</registerRecords>
  <registerRecords>AccumulationRegister.ВыработкаОС</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_ПлановыеНачисленияРаботниковОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_РеализацияОрганизаций</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_ДанныеПоКачествуЗерна</registerRecords>
  <registerRecords>InformationRegister.СпособыОтраженияРасходовПоАмортизацииНМАБухгалтерскийУчет</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗаполнения</name>
    <type>
      <types>CatalogRef.УдалитьВнешниеОбработки</types>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СторнируемыйДокумент</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТиповаяОперация</name>
    <type>
      <types>CatalogRef.УдалитьВнешниеОбработки</types>
      <types>CatalogRef.ТиповыеОперации</types>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаполнениеДвижений</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗапрашиваемыеПараметры</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаРегистровНакопления</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>Имя</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаРегистровРасчета</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>Имя</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаРегистровСведений</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>Имя</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BAS BMEKZU Project/src/Documents/ОперацияБух/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Перем мСтруктураПараметров;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаКнопкиКоманднойПанели;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	
	ОбщегоНазначенияБПВызовСервера.УстановитьОтборПоОсновнойОрганизации(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	АдресХранилищаНастройкиДинСпискаДляРеестра = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеОсновнойОрганизации" Тогда
		ОбщегоНазначенияБПКлиент.ИзменитьОтборПоОсновнойОрганизации(Список, ,Параметр);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	СтруктураПараметров = ПолучитьСтруктуруПараметровФормы("Вручную");
	Если Копирование Тогда
		СтруктураПараметров.Вставить("ЗначениеКопирования", Элементы.Список.ТекущиеДанные.Ссылка);
	КонецЕсли;
	ОткрытьФорму("Документ.ОперацияБух.ФормаОбъекта", СтруктураПараметров, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)

	КлючеваяОперация = "ОткрытиеФормыОперацияБух";
	ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени(КлючеваяОперация);

КонецПроцедуры

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки)

	ОбщегоНазначенияБП.ВосстановитьОтборСписка(Список, Настройки, "Организация");

КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьСторноДокумента(Команда)
	
	СтруктураПараметров = ПолучитьСтруктуруПараметровФормы("Сторно");
	ОткрытьФорму("Документ.ОперацияБух.ФормаОбъекта", СтруктураПараметров, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьОперацию(Команда)
	
	СтруктураПараметров = ПолучитьСтруктуруПараметровФормы("Вручную");
	ОткрытьФорму("Документ.ОперацияБух.ФормаОбъекта", СтруктураПараметров, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьТиповуюОперацию(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьТиповуюОперациюЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.ТиповыеОперации.ФормаВыбора",,ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастройкиДинамическогоСписка()
	
	Отчеты.РеестрДокументов.НастройкиДинамическогоСписка(ЭтотОбъект);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	Если Команда.Имя = "ПодменюПечатьОбычное_Реестр" Тогда
		НастройкиДинамическогоСписка();
	КонецЕсли;
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Функция ПолучитьСтруктуруПараметровФормы(СпособЗаполнения = "")

	КлючеваяОперация = "СозданиеФормыОперацияБух";
	ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени(КлючеваяОперация);
	
	СтруктураПараметров = Новый Структура;
	
	ЗначенияЗаполнения = ОбщегоНазначенияБПВызовСервера.ЗначенияЗаполненияДинамическогоСписка(Список.КомпоновщикНастроек);
	
	СпособыЗаполнения = Новый Массив;
	СпособыЗаполнения.Добавить("Вручную");
	СпособыЗаполнения.Добавить("Сторно");
	СпособыЗаполнения.Добавить("ТиповаяОперация");
	
	Если СпособыЗаполнения.Найти(СпособЗаполнения) <> Неопределено Тогда
		ЗначенияЗаполнения.Вставить("СпособЗаполнения", СпособЗаполнения);
	ИначеЕсли НЕ ЗначенияЗаполнения.Свойство("СпособЗаполнения")
		ИЛИ СпособыЗаполнения.Найти(ЗначенияЗаполнения.СпособЗаполнения) = Неопределено Тогда
		ЗначенияЗаполнения.Вставить("СпособЗаполнения", СпособыЗаполнения[0]);
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаКлиенте
Процедура СоздатьТиповуюОперациюЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		мСтруктураПараметров = ПолучитьСтруктуруПараметровФормы("ТиповаяОперация");
		мСтруктураПараметров.ЗначенияЗаполнения.Вставить("ТиповаяОперация", Результат);
		ПодключитьОбработчикОжидания("Подключаемый_СоздатьТиповуюОперацию", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СоздатьТиповуюОперацию()
	
	ОткрытьФорму("Документ.ОперацияБух.ФормаОбъекта", мСтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти
